[
  "multi-column-markdown",
  "dataview",
  "templater-obsidian",
  "obsidian-icon-folder",
  "oz-calendar",
  "homepage",
  "customjs",
  "quickadd",
  "obsidian-admonition",
  "copy-as-html",
  "obsidian42-brat",
  "obsidian-snippet-downloader",
  "excel",
  "recent-files-obsidian",
  "obsidian-pandoc",
  "obsidian-columns",
  "obsidian-git",
  "obsidian-excalidraw-plugin",
  "obsidian-enhancing-mindmap",
  "obsidian-style-settings",
  "obsidian-linter",
  "obsidian-custom-attachment-location",
  "obsidian-paste-to-current-indentation"
]