---
title: CS - 자료구조
author: Me
date: 2024-08-27 00:00:00 +0900
categories:
- 개발 공부
- CS
---

## 자료구조의 종류

1. 배열
   - 연속된 공간에 값을 저장함.
   - 랜덤 접근이 O(1)로 빠르다.
   - 값을 새로 삽입하거나 삭제할 수 없다.


2. 연결리스트(Linked List)
   - 각 노드가 다음 노드를 저장함.
   - 랜덤 접근에 O(n)이 걸림.
   - 삽입/삭제가 빠르다.


3. 스택
   - LIFO 방식. 마지막에 넣은 게 가장 먼저 나온다.
   - 랜덤 접근 불가. top의 값만 접근/삽입/삭제 가능.


4. 힙
   - FIFO 방식. 넣은 순서대로 나온다.
   - 랜덤 접근 불가. front의 값만 접근/삽입/삭제 가능.


5. 이진트리
   - 랜덤 접근 불가.
   - 삽입/삭제에 O(logN)의 시간이 걸림. 최악의 경우 O(n).
   - 정렬과 검색에 O(logN)의 시간이 걸림. 최악의 경우 O(n).


## C++의 자료구조

#### Vector
가장 흔하게 쓰이는 vector의 경우 배열과 유사한 특성을 가짐. 다만 값을 새로 삽입하거나 삭제할 수 있으며, 이 경우 O(n)의 시간복잡도를 가짐. 단, 맨 끝에 삽입할 땐 O(1)임.

#### Set, Map
내부적으로 이진트리로 구현됨. 랜덤 접근은 불가하지만 key값으로 검색해서 O(logN)의 시간에 접근 가능.